# GetExternalGeometryId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeReferenceOptions..::..GetExternalGeometryId Method
DirectShapeReferenceOptions Class See Also
---
Retrieves the ExternalGeometryId associated with the reference object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ExternalGeometryId GetExternalGeometryId()
```

Visual Basic
---
```text
Public Function GetExternalGeometryId As ExternalGeometryId
```

Visual C++
---
```text
public:
ExternalGeometryId^ GetExternalGeometryId()
```

# Remarks
If an ExternalGeometryId has not been set, this method returns nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace